//Запросите у пользователя его имя. Выведите в окошке (с помощью функции alert) фразу: Привет, Николай! (вместо Николай должно показываться имя, которое ввел пользователь)
let user = prompt("Введите ваше имя");
alert('Привет,' + user);

//Запросите у пользователя число. Затем запросите степень, в которую нужно возвести это число. Выведите в консоль результат.
let point = prompt('Число?');
alert('Ваше число ' + point);
let st = prompt('Степень?');
alert('Ваш конечный результат - ' + point ** st + ')))');
